src/DataProcessors/ГенераторОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ГенераторОбъектов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Enums/ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСкладов</Name>
			<Comment>Виды складов(Обычный, Ордерный, Ордерный и ячеистый)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
					<Comment>Обычный склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ордерный</Name>
					<Comment>Ордерный  склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрдерныйЯчеистый</Name>
					<Comment>Ордерный и ячеистый склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ячеистый</Name>
					<Comment>Ячеистый склад</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<Comment>Индивидуальный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяФормаСобственности</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Comment>Обособленное подразделение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<Comment>Виды контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Основное взаимодействие с контрагентом - продажа, передача на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Основное взаимодействие с контрагентом - закупка и принятие на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Comment>Подотчетное лицо компании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал компании, одна из организаций</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственник</Name>
					<Comment>Собственник компании, осуществляющий финансирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие контрагенты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производитель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
			<Comment>Виды договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Договоры с поставщиками</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Договоры с покупателями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>Договор комиссии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>Договор с комитентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Общий договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Договор кредита</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
					<Comment>По умолчанию для контрагентов такого вида выбирается именно такой тип договора</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
					<Comment>Зарплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратнаяТара</Name>
					<Comment>Договор по возвратной таре</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переработка</Name>
					<Comment>Переработка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ГенераторОбъектов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоздатьОбъекты(Команда)
	
	Если Склады > 0 Тогда
		СоздатьСклады();
	КонецЕсли;
	
	Если Кассы > 0 Тогда
		СоздатьКассы();
	КонецЕсли;
	
	Если КонтрагентыПоставщики > 0 Тогда
		СоздатьКонтрагенты();
	КонецЕсли;
	
	Если КонтрагентыПокупатели> 0 Тогда
		СоздатьКонтрагенты(Ложь);
	КонецЕсли;
	
	Если НЕ ЗагрузитьПрайсЛист = "" Тогда
		ЗагрузитьПрайсЛист();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСклады()
	
	// Вытащим подразделения
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодразделенияКомпании.Ссылка КАК ПодразделенияКомпании,
	               |	ПодразделенияКомпании.Организация
	               |ИЗ
	               |	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании";
	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоПодразделений = Выборка.Количество();
	КоличествоСкладовПоПодразделениям = Склады / ВсегоПодразделений;
	ТипЦен =  Справочники.ТипыЦен.НайтиПоНаименованию("Розничная фиксированная");
	
	ВсегоСоздано = 0;
	Гсч = Новый ГенераторСлучайныхЧисел(ТекущаяДатаСеанса() - НачалоГода(ТекущаяДатаСеанса()));
	Пока Выборка.Следующий() И ВсегоСоздано<Склады Цикл
		СозданоЭлементов = 0;
		Пока СозданоЭлементов < КоличествоСкладовПоПодразделениям Цикл
			НовыйЭлемент = Справочники.СкладыКомпании.СоздатьЭлемент();
			НовыйЭлемент.ПодразделениеКомпании = Выборка.ПодразделенияКомпании;
			НовыйЭлемент.Организация = Выборка.Организация;
			НовыйЭлемент.ВидСклада = Перечисления.ВидыСкладов.Обычный;
			Если СозданоЭлементов%2 = 0 Тогда
				НовыйЭлемент.Розничный = Истина;
				НовыйЭлемент.НомерОтделаДляККМ = 1;
				НовыйЭлемент.ТипЦенРозничнойТорговли = ТипЦен;
			КонецЕсли;
			НовыйЭлемент.Наименование = "Склад" + ?(НовыйЭлемент.Розничный,"Розничный","") +Выборка.ПодразделенияКомпании + Гсч.СлучайноеЧисло(0,1000);
			НовыйЭлемент.Записать();
			СозданоЭлементов = СозданоЭлементов + 1;
			ВсегоСоздано = ВсегоСоздано+1;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКассы()
	
	// Вытащим подразделения
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодразделенияКомпании.Ссылка КАК ПодразделенияКомпании,
	               |	ПодразделенияКомпании.Организация
	               |ИЗ
	               |	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании";
	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоПодразделений = Выборка.Количество();
	КоличествоКассПоПодразделениям = Кассы / ВсегоПодразделений;
	
	Валюта = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	ВсегоСоздано = 0;
	Гсч = Новый ГенераторСлучайныхЧисел(ТекущаяДатаСеанса() - НачалоГода(ТекущаяДатаСеанса()));
	Пока Выборка.Следующий() И ВсегоСоздано<Кассы Цикл
		СозданоЭлементов = 0;
		Пока СозданоЭлементов < КоличествоКассПоПодразделениям Цикл
			НовыйЭлемент = Справочники.КассыКомпании.СоздатьЭлемент();
			НовыйЭлемент.ПодразделениеКомпании = Выборка.ПодразделенияКомпании;
			НовыйЭлемент.Организация = Выборка.Организация;
			НовыйЭлемент.ВалютаДенежныхСредств = Валюта;
			НовыйЭлемент.Наименование = "Касса" + Выборка.ПодразделенияКомпании + Гсч.СлучайноеЧисло(0,1000);
			НовыйЭлемент.Записать();
			СозданоЭлементов = СозданоЭлементов + 1;
			ВсегоСоздано = ВсегоСоздано+1;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКонтрагенты(Поставщик = Истина)
	
	// Вытащим подразделения
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодразделенияКомпании.Ссылка КАК ПодразделенияКомпании,
	               |	ПодразделенияКомпании.Организация
	               |ИЗ
	               |	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Всего = Выборка.Количество();
	КоличествоПоПодразделениям = ?(Поставщик,КонтрагентыПоставщики,КонтрагентыПокупатели)/ Всего;
	Валюта = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	ВсегоСоздано = 0;
	Гсч = Новый ГенераторСлучайныхЧисел(ТекущаяДатаСеанса() - НачалоГода(ТекущаяДатаСеанса()));
	Пока Выборка.Следующий() И ВсегоСоздано<?(Поставщик,КонтрагентыПоставщики,КонтрагентыПокупатели) Цикл
		СозданоЭлементов = 0;
		Пока СозданоЭлементов < КоличествоПоПодразделениям Цикл
			НовыйЭлемент = Справочники.Контрагенты.СоздатьЭлемент();
			НовыйЭлемент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
			НовыйЭлемент.ВидКонтрагента = ?(Поставщик,Перечисления.ВидыКонтрагентов.Поставщик,Перечисления.ВидыКонтрагентов.Покупатель);
			НовыйЭлемент.Наименование = ?(Поставщик,"Поставщик","Покупатель") + Гсч.СлучайноеЧисло(0,1000);
			НовыйЭлемент.НаименованиеПолное = ?(Поставщик,"Поставщик","Покупатель") + Гсч.СлучайноеЧисло(0,1000);
			НовыйЭлемент.Записать();
			СозданоЭлементов = СозданоЭлементов + 1;
			
			// Создадим договора
			ВидыДоговоров = Новый Массив;
			ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.Покупка);
			ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.Продажа);
			ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.СКомиссионером);
			ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.СКомитентом);
			
			Для Каждого Строка Из ВидыДоговоров Цикл
				
				НовыйЭлементДоговора = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
				НовыйЭлементДоговора.ВидДоговора = Строка;
				НовыйЭлементДоговора.Владелец = НовыйЭлемент.Ссылка;
				НовыйЭлементДоговора.ВалютаВзаиморасчетов = Валюта;
				НовыйЭлементДоговора.ПроцентПредоплаты = -1;
				НовыйЭлементДоговора.ДатаНачала = НачалоГода(ТекущаяДатаСеанса());
				НовыйЭлементДоговора.ПодразделениеКомпании = Выборка.ПодразделенияКомпании;
				НовыйЭлементДоговора.Организация = Выборка.Организация;
				НовыйЭлементДоговора.Наименование = ""+ НовыйЭлемент.Ссылка + Строка + Гсч.СлучайноеЧисло(0,1000);
				НовыйЭлементДоговора.АвтоЗакрытиеСделок = НовыйЭлементДоговора.Организация.АвтоЗакрытиеСделок;
				НовыйЭлементДоговора.Записать();
				СозданоЭлементов = СозданоЭлементов + 1;
			КонецЦикла;
			ВсегоСоздано = ВсегоСоздано+1;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПрайсЛист()
	
	ТаблицаИзПрайса = ЗагрузитьИзEXCEL();
	ТаблицаИзПрайса.Колонки.Добавить("Цена2",Новый ОписаниеТипов("Число"),"Цена2");
	ТаблицаИзПрайса.Колонки.Добавить("Цена3",Новый ОписаниеТипов("Число"),"Цена3");
	ТаблицаИзПрайса.Колонки.Добавить("Ссылка",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),"Ссылка");
	ТаблицаИзПрайса.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),"Характеристика");
	
	// Получим Номенклатуру
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура";
	ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
	КоличествоНоменклатуры = ТаблицаНоменклатуры.Количество();
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = "ВЫБРАТЬ
	                |	ХарактеристикиНоменклатуры.Ссылка,
	                |	ХарактеристикиНоменклатуры.Владелец
	                |ИЗ
	                |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры";
	ТаблицаХарактеристик = Запрос2.Выполнить().Выгрузить();
	
	Подсчет = 0;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(255);
	
	ТипЦенРозница = Справочники.ТипыЦен.НайтиПоНаименованию("Розничная фиксированная");
	ТипЦенПродажа = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
	ТипЦенЗакупка = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
	
	НовыйДокумент = Документы.ИзменениеЦен.СоздатьДокумент();
	НовыйДокумент.Заполнить(Неопределено);
	НоваяСтрока = НовыйДокумент.ПараметрыРасчета.Добавить();
	НоваяСтрока.ТипЦен = ТипЦенЗакупка;
	НоваяСтрока = НовыйДокумент.ПараметрыРасчета.Добавить();
	НоваяСтрока.ТипЦен = ТипЦенПродажа;
	НоваяСтрока = НовыйДокумент.ПараметрыРасчета.Добавить();
	НоваяСтрока.ТипЦен = ТипЦенРозница;
	
	СозданоЭлементов = 0;
	Для Каждого Строка Из ТаблицаИзПрайса Цикл
		
		Если СозданоЭлементов > КоличествоЗагружаемойНоменклатуры Тогда
			Прервать;
		КонецЕсли;
		
		Если Строка.Наименование = "" ИЛИ Строка.Цена = "" Тогда
			Продолжить;
		КонецЕсли;
		
		СуществующаяНоменклатура = ТаблицаНоменклатуры.Получить(Подсчет);
		
		НовыйЭлемент = СуществующаяНоменклатура.Ссылка.Скопировать();
		НовыйЭлемент.Наименование = Строка.Наименование;
		НовыйЭлемент.НаименованиеИностранное = Строка.Наименование;
		НовыйЭлемент.НаименованиеПолное = Строка.Наименование;
		НовыйЭлемент.Артикул = Строка.Код;
		НовыйЭлемент.Записать();
		
		// скопируем основную единицу
		НовыйЭлементЕИ = СуществующаяНоменклатура.Ссылка.ОсновнаяЕдиницаИзмерения.Скопировать();
		НовыйЭлементЕИ.Владелец = НовыйЭлемент.Ссылка;
		НовыйЭлементЕИ.Записать();
		
		НовыйЭлемент.ОсновнаяЕдиницаИзмерения = НовыйЭлементЕИ.Ссылка;
		НовыйЭлемент.Записать();
		
		// Скопируем характеристики
		СтрокиХарактеристик = ТаблицаХарактеристик.НайтиСтроки(Новый Структура("Владелец",СуществующаяНоменклатура.Ссылка));
		
		Если СтрокиХарактеристик.Количество() = 0 Тогда
			
			// Цены
			ЦенаЗакупки = ?(Число(Строка.Цена) = 0, Число(Строка.Цена), Гсч.СлучайноеЧисло(1,1000));
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура = НовыйЭлемент.Ссылка;
			НоваяСтрока.ТипЦен = ТипЦенЗакупка;
			НоваяСтрока.Цена = ЦенаЗакупки;
			Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(НовыйДокумент,НоваяСтрока);
			
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура = НовыйЭлемент.Ссылка;
			НоваяСтрока.ТипЦен = ТипЦенПродажа;
			НоваяСтрока.Цена = ЦенаЗакупки + 0.2*ЦенаЗакупки;
			Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(НовыйДокумент,НоваяСтрока);
			
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура = НовыйЭлемент.Ссылка;
			НоваяСтрока.ТипЦен = ТипЦенРозница;
			НоваяСтрока.Цена = ЦенаЗакупки + 0.4*ЦенаЗакупки;
			Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(НовыйДокумент,НоваяСтрока);
			
		Иначе
			
			Для Каждого СтрокаХарактеристик Из СтрокиХарактеристик Цикл
				
				// скопируем 
				НовыйЭлементХарактеристик = СтрокаХарактеристик.Ссылка.Скопировать();
				НовыйЭлементХарактеристик.Владелец = НовыйЭлемент.Ссылка;
				НовыйЭлементХарактеристик.Наименование = "" + СтрокаХарактеристик.Ссылка.Наименование + НовыйЭлемент.Ссылка;
				НовыйЭлементХарактеристик.Записать();
				
				// Цены
				ЦенаЗакупки = ?(Число(Строка.Цена) = 0, Число(Строка.Цена), Гсч.СлучайноеЧисло(1,1000));
				НоваяСтрока = НовыйДокумент.Товары.Добавить();
				НоваяСтрока.Номенклатура = НовыйЭлемент.Ссылка;
				НоваяСтрока.ХарактеристикаНоменклатуры = НовыйЭлементХарактеристик.Ссылка;
				НоваяСтрока.ТипЦен = ТипЦенЗакупка;
				НоваяСтрока.Цена = ЦенаЗакупки;
				Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(НовыйДокумент,НоваяСтрока);
				
				НоваяСтрока = НовыйДокумент.Товары.Добавить();
				НоваяСтрока.Номенклатура = НовыйЭлемент.Ссылка;
				НоваяСтрока.ХарактеристикаНоменклатуры = НовыйЭлементХарактеристик.Ссылка;
				НоваяСтрока.ТипЦен = ТипЦенПродажа;
				НоваяСтрока.Цена = ЦенаЗакупки + 0.2*ЦенаЗакупки;
				Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(НовыйДокумент,НоваяСтрока);
				
				НоваяСтрока = НовыйДокумент.Товары.Добавить();
				НоваяСтрока.Номенклатура = НовыйЭлемент.Ссылка;
				НоваяСтрока.ХарактеристикаНоменклатуры = НовыйЭлементХарактеристик.Ссылка;
				НоваяСтрока.ТипЦен = ТипЦенРозница;
				НоваяСтрока.Цена = ЦенаЗакупки + 0.4*ЦенаЗакупки;
				Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(НовыйДокумент,НоваяСтрока);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Строка.Ссылка = НовыйЭлемент.Ссылка;
		Если Подсчет = КоличествоНоменклатуры - 1 Тогда
			Подсчет = 0;
		Иначе
			Подсчет = Подсчет+1;
		КонецЕсли;
		СозданоЭлементов = СозданоЭлементов + 1;
		
	КонецЦикла;
	
	// Дополним существующей номенклатурой
	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		
		СтрокиХарактеристик = ТаблицаХарактеристик.НайтиСтроки(Новый Структура("Владелец",СуществующаяНоменклатура.Ссылка));
		Если СтрокиХарактеристик.Количество() = 0 Тогда
			ЦенаЗакупки = Гсч.СлучайноеЧисло(1,1000);
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура = Строка.Ссылка;
			НоваяСтрока.ТипЦен = ТипЦенЗакупка;
			НоваяСтрока.Цена = ЦенаЗакупки;
			Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(НовыйДокумент,НоваяСтрока);
			
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура = Строка.Ссылка;
			НоваяСтрока.ТипЦен = ТипЦенПродажа;
			НоваяСтрока.Цена = ЦенаЗакупки + 0.2*ЦенаЗакупки;
			Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(НовыйДокумент,НоваяСтрока);
			
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура = Строка.Ссылка;
			НоваяСтрока.ТипЦен = ТипЦенРозница;
			НоваяСтрока.Цена = ЦенаЗакупки + 0.4*ЦенаЗакупки;
			Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(НовыйДокумент,НоваяСтрока);
		Иначе
			
			Для Каждого СтрокаХарактеристик Из СтрокиХарактеристик Цикл
				
				// Цены
				ЦенаЗакупки = ?(Число(Строка.Цена) = 0, Число(Строка.Цена), Гсч.СлучайноеЧисло(1,1000));
				НоваяСтрока = НовыйДокумент.Товары.Добавить();
				НоваяСтрока.Номенклатура = НовыйЭлемент.Ссылка;
				НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаХарактеристик.Ссылка;
				НоваяСтрока.ТипЦен = ТипЦенЗакупка;
				НоваяСтрока.Цена = ЦенаЗакупки;
				Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(НовыйДокумент,НоваяСтрока);
				
				НоваяСтрока = НовыйДокумент.Товары.Добавить();
				НоваяСтрока.Номенклатура = НовыйЭлемент.Ссылка;
				НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаХарактеристик.Ссылка;
				НоваяСтрока.ТипЦен = ТипЦенПродажа;
				НоваяСтрока.Цена = ЦенаЗакупки + 0.2*ЦенаЗакупки;
				Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(НовыйДокумент,НоваяСтрока);
				
				НоваяСтрока = НовыйДокумент.Товары.Добавить();
				НоваяСтрока.Номенклатура = НовыйЭлемент.Ссылка;
				НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаХарактеристик.Ссылка;
				НоваяСтрока.ТипЦен = ТипЦенРозница;
				НоваяСтрока.Цена = ЦенаЗакупки + 0.4*ЦенаЗакупки;
				Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(НовыйДокумент,НоваяСтрока);
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	// скопируем цены для всех подразделений
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодразделенияКомпании.Организация,
	               |	ПодразделенияКомпании.Ссылка КАК ПодразделениеКомпании
	               |ИЗ
	               |	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Копия = НовыйДокумент.Ссылка.Скопировать();
		Копия.ПодразделениеКомпании = Выборка.ПодразделениеКомпании;
		Копия.ПодразделениеКомпанииПолучатель = Выборка.ПодразделениеКомпании;
		Копия.Организация = Выборка.Организация ;
		Копия.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

// Загрузка прайса
&НаСервере
Функция  ЗагрузитьИзEXCEL()
	
	// подключаемся к эксель
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.AutomationSecurity = 3;
		Excel.WorkBooks.Open(ЗагрузитьПрайсЛист);	
	Исключение
		ВывестиСообщение(НСтр("ru = 'Ошибка при открытии файла с помощью Excel. Загрузка не будет произведена.'"));
		ВывестиСообщение(ОписаниеОшибки());
		Возврат ЛОЖЬ;
	КонецПопытки;
	
	Попытка
		// Открываем необходимый лист
		Excel.Sheets(1).Select(); // лист 1, по умолчанию
	Исключение
		// Закрываем Excel
		Excel.ActiveWorkbook.Close();
		Excel = 0;
		ВывестиСообщение(НСтр("ru = 'Файл'") + " " + Строка(ЗагрузитьПрайсЛист) + " " + НСтр("ru = 'не соответствует необходимому формату. Первый лист не найден.'"));
		Возврат ЛОЖЬ;
	КонецПопытки;
	
	// Получим количество строк и колонок.
	// В разных версиях Excel получаются по-разному, поэтому сначала определим версию Excel.
	Версия = Лев(Excel.Version,СтрНайти(Excel.Version,".")-1);
	Если Версия = "8" Тогда
		ФайлСтрок = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;
	КонецЕсли;
	
	Сч = 1;
	Таблица = Новый ТаблицаЗначений;
	Пока ЗначениеЗаполнено(Excel.Cells(1, Сч).Text) Цикл
		ИмяКолонки = Excel.Cells(1, Сч).Text;
		ИмяБезПробелов = СтрЗаменить(ИмяКолонки," ",""); // убираем из имени колонок пробелы
		Таблица.Колонки.Добавить(ИмяБезПробелов,Новый ОписаниеТипов("Строка"),ИмяКолонки);
		Сч = Сч + 1;
	КонецЦикла;
	
	Для НС = 2 По ФайлСтрок Цикл // НС указываем с какой строки начинать обработку
		
		НоваяСтрока = Таблица.Добавить();
		
		Для НомерКолонки = 1 По Таблица.Колонки.Количество() Цикл
			// Заполняем строку значениями
			ТекущееЗначение = Excel.Cells(НС, НомерКолонки).Text;
			ИмяКолонки = Таблица.Колонки[НомерКолонки-1].Имя;
			НоваяСтрока[ИмяКолонки] = ТекущееЗначение;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции //ЗагрузитьИзEXCEL()

&НаКлиенте
Процедура ЗагрузитьПрайсЛистНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = НСтр("ru = 'Выберите файл'");
	
	Если ДиалогВыбора.Выбрать() Тогда
		ЗагрузитьПрайсЛист = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры
